CITIES = [
    "Москва", "Санкт-Петербург", "Казань", "Екатеренбург", "Нижний Новгород", "Пермь", "Челябинск", "Уфа"
]

DEVICE_TYPES = [
    "Смартфон", "Ноутбук", "Планшет", "Другое"
]

MANUFACTURERS = [
    "Apple", "Samsung", "Acer", "Asus", "HP", "HUAWEI", "Honor", "Xiaomi", "MSI", "Sony", "Другое"
]

DEFECT_TYPES = [
    {
        "name": "Общие проблемы",
        "reasons": ["Не включается", "Попала влага", "Перезагружается", "Сильно греется", "Долго включается"]
    },
    {
        "name": "Экран",
        "reasons": ["Гаснет", "Разбился/треснул", "Не включается", "Проблема с изображением"]
    },
    {
        "name": "Интернет",
        "reasons": ["Нет подключения", "Подключение есть, но нет интернета"]
    },
    {
        "name": "Зарядка",
        "reasons": ["Не заряжается", "Быстро садится/Не держит заряд", "Переодически пропадает контакт с зарядкой"]
    },
    {
        "name": "Установка",
        "reasons": ["Установка/Обновление ОС", "Установка антивируса", "Установка банковских программ", "Установка прочих программ"]
    },
    {
        "name": "Что-то не работает",
        "reasons": ["Экран не работает", "Камера не работает", "Блок питания не работает", "Звук не работает", "Что-то другое не работает"]
    },
    {
        "name": "Диагностика",
        "reasons": []
    },
    {
        "name": "Прочие проблемы",
        "reasons": []
    },
]
